import { z } from "zod";

export const loginSchema = z.object({
    login: z
        .string()
        .min(4, "Минимум 4 символов")
        .max(32, "Максимум 32 символа"),

    newPassword: z
        .string()
        .min(8, "Минимум 8 символов")
        .max(32, "Максимум 32 символа")
        .regex(
            /^[A-Za-z0-9!@#$%^&*()_+\-=\[\]{};':"\\|,.<>/?`~]+$/,
            "Пароль может содержать только латиницу, цифры и спецсимволы",
        ),
    password: z
        .string()
        .min(8, "Минимум 8 символов")
        .max(32, "Максимум 32 символа"),
});
